zc110747/MCU-Agent/102.stm32f429_tinyusb_ui/app/app_ui.c
/**
  ******************************************************************************
  * @file    app_ui.c
  * @brief   Multi-page LVGL screen for the STM32F429 panel (minimal dark theme).
  *
  *  Geometry
  *  --------
  *  Nothing here is hardcoded to 800x480.  The layout is derived from the
  *  resolution the LVGL display was actually registered with, which is the
  *  active GRAM window reported by the LCD driver (480x800 on the NT35510
  *  module this project is built for).  Deriving it means the panel fills the
  *  glass whatever orientation the controller ends up in, and it is the one
  *  place that has to change if LCD_WIDTH / LCD_HEIGHT are ever retuned.
  *
 *  Pages
 *  -----
 *    0  状态       系统初始化 / 运行信息 / 故障·消息
 *    1  硬件信息    AP3216C 与 MPU9250 实时读数
 *    2  控制       两个按键切换 LED(PB0) 与蜂鸣器(PCF8574 P0)，并显示状态
 *
  *  The bottom navigation bar is shared by both pages.  Its left and right
  *  buttons are drawn as LVGL line chevrons rather than text glyphs, so they
  *  render identically with or without the SD-card font files.
  ******************************************************************************
  */
#include "app_ui.h"
#include "lvgl.h"
#include "lv_font_gbk.h"
#include "bsp_lcd.h"
#include "bsp_lcd_text.h"
#include "bsp_touch.h"
#include "usb_host_app.h"
#include "sd_card.h"
#include "sensor_task.h"
#include "bsp_led.h"
#include "bsp_pcf8574.h"
#include "stm32f4xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include "log.h"

/* ---- Geometry -------------------------------------------------------------- */
#define UI_PAD      12
#define HDR_H       34
#define NAV_H       56
#define BAND_GAP    10
#define TOP_GAP     8

/* ---- Nav bar --------------------------------------------------------------- */
#define NAV_BTN_W   72
#define NAV_BTN_H   44

/* ---- Palette (minimal: dark bg, light text, no accents) -------------------- */
#define COL_BG      0x000000
#define COL_HDR     0x12161C
#define COL_TXT     0xD2D6DC
#define COL_DIM     0x808890
#define COL_BTN     0x1C222B

/* 2 Hz refresh: snappy enough for the sensor page, cheap enough for the pump. */
#define UI_REFRESH_MS  500U

typedef enum
{
    PAGE_STATUS = 0,
    PAGE_HWINFO = 1,
    PAGE_CTRL   = 2
} ui_page_t;

/* Chevron point sets for the two navigation buttons.  lv_line keeps its own
 * coordinate space, so these are relative to the line object's top-left. */
static const lv_point_t s_chevron_left[3]  = { { 14, 2 }, { 5, 10 }, { 14, 18 } };
static const lv_point_t s_chevron_right[3] = { { 6, 2 }, { 15, 10 }, { 6, 18 } };

typedef struct
{
    /* page 0 - status */
    lv_obj_t *p0_sd;
    lv_obj_t *p0_usb;
    lv_obj_t *p0_font;
    lv_obj_t *p0_freq;
    lv_obj_t *p0_uptime;
    lv_obj_t *p0_cache;
    lv_obj_t *p0_f1;
    lv_obj_t *p0_f2;
    lv_obj_t *p0_f3;
    /* page 1 - hardware information */
    lv_obj_t *p1_ir;
    lv_obj_t *p1_als;
    lv_obj_t *p1_ps;
    lv_obj_t *p1_acc;
    lv_obj_t *p1_gyr;
    lv_obj_t *p1_mag;
    lv_obj_t *p1_stat;
    /* page 2 - device control */
    lv_obj_t *p2_led_btn;
    lv_obj_t *p2_beep_btn;
    lv_obj_t *p2_led_lbl;
    lv_obj_t *p2_beep_lbl;
    lv_obj_t *p2_led_state;
    lv_obj_t *p2_beep_state;
    /* shared */
    lv_obj_t *page_lbl;
} ui_handles_t;

static ui_handles_t s_ui;
static lv_timer_t  *s_timer      = NULL;
static uint32_t     s_uptime_sec = 0U;
static uint32_t     s_last_sec_at = 0U;
static uint8_t      s_built      = 0U;
static uint8_t      s_refresh_req = 0U;
static int          s_page       = (int)PAGE_STATUS;
static uint8_t      s_led_on     = 0U;   /* LED1 (PB0) state shown on ctrl page */
static uint8_t      s_beep_on    = 0U;   /* buzzer (PCF8574 P0) state */

/* Derived layout, recomputed on every rebuild. */
static lv_coord_t   s_w       = 0;
static lv_coord_t   s_h       = 0;
static lv_coord_t   s_band_y[3];
static lv_coord_t   s_band_h  = 0;
static lv_coord_t   s_nav_y   = 0;

/*----------------------------------------------------------------------------*/
/* Helpers                                                                    */
/*----------------------------------------------------------------------------*/
static lv_obj_t *mk_label(lv_obj_t *parent, lv_coord_t x, lv_coord_t y,
                          const lv_font_t *font, uint32_t color,
                          const char *text)
{
    lv_obj_t *lbl = lv_label_create(parent);

    lv_obj_set_style_text_font(lbl, font, LV_PART_MAIN);
    lv_obj_set_style_text_color(lbl, lv_color_hex(color), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(lbl, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_pad_all(lbl, 0, LV_PART_MAIN);
    lv_label_set_text(lbl, text);
    lv_obj_set_pos(lbl, x, y);

    return lbl;
}

static lv_obj_t *mk_label_center(lv_obj_t *parent, lv_coord_t y,
                                const lv_font_t *font, uint32_t color,
                                const char *text)
{
    lv_obj_t *lbl = mk_label(parent, 0, y, font, color, text);

    lv_obj_set_width(lbl, s_w);
    lv_obj_set_style_text_align(lbl, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_pos(lbl, 0, y);

    return lbl;
}

static lv_obj_t *make_band(lv_obj_t *parent, lv_coord_t y, lv_coord_t h,
                           const char *title)
{
    lv_obj_t *card = lv_obj_create(parent);

    lv_obj_remove_style_all(card);
    lv_obj_set_size(card, s_w - (2 * UI_PAD), h);
    lv_obj_set_pos(card, UI_PAD, y);
    lv_obj_set_style_bg_color(card, lv_color_hex(COL_HDR), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(card, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_border_color(card, lv_color_hex(COL_DIM), LV_PART_MAIN);
    lv_obj_set_style_border_width(card, 1, LV_PART_MAIN);
    lv_obj_set_style_pad_all(card, 0, LV_PART_MAIN);
    lv_obj_clear_flag(card, LV_OBJ_FLAG_SCROLLABLE);

    (void)mk_label(card, 8, 6, &lv_font_gbk_16, COL_TXT, title);

    return card;
}

static void ui_set_screen_bg(lv_obj_t *scr)
{
    lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_set_style_bg_color(scr, lv_color_hex(COL_BG), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_pad_all(scr, 0, LV_PART_MAIN);
}

/**
  * @brief  Format a float with two decimals without pulling in the floating
  *         point printf support of newlib-nano (which is not linked).
  */
static void fmt_fixed2(char *buf, size_t n, float v)
{
    int  neg = (v < 0.0f) ? 1 : 0;
    float a  = neg ? -v : v;
    long ip  = (long)a;
    long fp  = (long)((a - (float)ip) * 100.0f + 0.5f);

    if (fp >= 100L) { fp -= 100L; ip += 1L; }
    (void)snprintf(buf, n, "%s%ld.%02ld", neg ? "-" : "", ip, fp);
}

