zc110747/MCU-Agent/102.stm32f429_tinyusb_ui/app/app_ui.c
static void fmt_vec3(char *buf, size_t n, const char *name,
                     float a, float b, float c, const char *unit)
{
    char fa[16], fb[16], fc[16];

    fmt_fixed2(fa, sizeof(fa), a);
    fmt_fixed2(fb, sizeof(fb), b);
    fmt_fixed2(fc, sizeof(fc), c);
    (void)snprintf(buf, n, "%s  X %s  Y %s  Z %s %s", name, fa, fb, fc, unit);
}

/**
  * @brief  Delete the refresh timer, then wipe the active screen.
  *         Order matters (see the file header).
  */
static void ui_teardown(void)
{
    if (s_timer != NULL)
    {
        lv_timer_del(s_timer);
        s_timer = NULL;
    }
    lv_obj_clean(lv_scr_act());
    (void)memset(&s_ui, 0, sizeof(s_ui));
    s_built = 0U;
}

/**
  * @brief  Recompute the layout from the resolution the display is registered
  *         with.  Done on every rebuild so a resolution change needs no edits.
  */
static void ui_layout(void)
{
    lv_coord_t content_y;
    lv_coord_t content_h;
    int i;

    s_w = (lv_coord_t)lv_disp_get_hor_res(NULL);
    s_h = (lv_coord_t)lv_disp_get_ver_res(NULL);

    if (s_w <= 0) { s_w = 1; }
    if (s_h <= 0) { s_h = 1; }

    content_y = HDR_H + TOP_GAP;
    content_h = s_h - content_y - NAV_H - TOP_GAP;
    if (content_h < (3 * BAND_GAP))
    {
        content_h = 3 * BAND_GAP;
    }

    s_band_h = (lv_coord_t)((content_h - (2 * BAND_GAP)) / 3);
    for (i = 0; i < 3; i++)
    {
        s_band_y[i] = (lv_coord_t)(content_y + (i * (s_band_h + BAND_GAP)));
    }

    s_nav_y = (lv_coord_t)(s_h - NAV_H);
}

/*----------------------------------------------------------------------------*/
/* Navigation bar                                                             */
/*----------------------------------------------------------------------------*/
static lv_obj_t *mk_nav_button(lv_obj_t *parent, lv_coord_t x, lv_coord_t y,
                               const lv_point_t *chevron)
{
    lv_obj_t *btn = lv_btn_create(parent);
    lv_obj_t *line;

    lv_obj_remove_style_all(btn);
    lv_obj_set_size(btn, NAV_BTN_W, NAV_BTN_H);
    lv_obj_set_pos(btn, x, y);
    lv_obj_set_style_bg_color(btn, lv_color_hex(COL_BTN), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn, lv_color_hex(COL_DIM), LV_PART_MAIN);
    lv_obj_set_style_border_width(btn, 1, LV_PART_MAIN);
    lv_obj_set_style_radius(btn, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_all(btn, 0, LV_PART_MAIN);
    lv_obj_clear_flag(btn, LV_OBJ_FLAG_SCROLLABLE);

    /* The chevron: a 20x20 line object centred in the button.  lv_line clears
     * LV_OBJ_FLAG_CLICKABLE in its constructor, so taps fall through to the
     * button behind it. */
    line = lv_line_create(btn);
    lv_obj_remove_style_all(line);
    lv_obj_set_size(line, 20, 20);
    lv_obj_set_pos(line, (NAV_BTN_W - 20) / 2, (NAV_BTN_H - 20) / 2);
    lv_obj_set_style_line_width(line, 3, LV_PART_MAIN);
    lv_obj_set_style_line_color(line, lv_color_hex(COL_TXT), LV_PART_MAIN);
    lv_obj_set_style_line_rounded(line, 1, LV_PART_MAIN);
    lv_line_set_points(line, chevron, 3);
    lv_obj_clear_flag(line, LV_OBJ_FLAG_CLICKABLE);

    return btn;
}

/*----------------------------------------------------------------------------*/
/* Control page buttons                                                       */
/*----------------------------------------------------------------------------*/
static void ctrl_btn_cb(lv_event_t *e);

/*----------------------------------------------------------------------------*/
/**
 * @brief  Build a large square-ish control button with a centered label.
 * @retval The label object, so the caller can update its caption on toggle.
 */
static lv_obj_t *mk_ctrl_button(lv_obj_t *parent, lv_coord_t x, lv_coord_t y,
                                lv_coord_t w, lv_coord_t h,
                                const char *title, int code)
{
    lv_obj_t *btn = lv_btn_create(parent);
    lv_obj_t *lbl;

    lv_obj_remove_style_all(btn);
    lv_obj_set_size(btn, w, h);
    lv_obj_set_pos(btn, x, y);
    lv_obj_set_style_bg_color(btn, lv_color_hex(COL_BTN), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn, lv_color_hex(COL_DIM), LV_PART_MAIN);
    lv_obj_set_style_border_width(btn, 1, LV_PART_MAIN);
    lv_obj_set_style_radius(btn, 6, LV_PART_MAIN);
    lv_obj_set_style_pad_all(btn, 0, LV_PART_MAIN);
    lv_obj_clear_flag(btn, LV_OBJ_FLAG_SCROLLABLE);

    lbl = lv_label_create(btn);
    lv_obj_set_style_text_font(lbl, &lv_font_gbk_24, LV_PART_MAIN);
    lv_obj_set_style_text_color(lbl, lv_color_hex(COL_TXT), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(lbl, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_pad_all(lbl, 0, LV_PART_MAIN);
    lv_label_set_text(lbl, title);
    lv_obj_align(lbl, LV_ALIGN_CENTER, 0, 0);
    /* Let taps fall through to the button so the CLICKED event is delivered. */
    lv_obj_clear_flag(lbl, LV_OBJ_FLAG_CLICKABLE);

    lv_obj_add_event_cb(btn, ctrl_btn_cb, LV_EVENT_CLICKED,
                        (void *)(intptr_t)code);

    return lbl;
}

static void ctrl_btn_cb(lv_event_t *e)
{
    int code = (int)(intptr_t)lv_event_get_user_data(e);

    LV_UNUSED(e);

    if (code == 1)
    {
        /* LED1 = PB0, low-active: On() drives the pin low. */
        s_led_on = s_led_on ? 0U : 1U;
        if (s_led_on != 0U)
        {
            BSP_LED_On(1);
        }
        else
        {
            BSP_LED_Off(1);
        }
        if (s_ui.p2_led_lbl != NULL)
        {
            lv_label_set_text(s_ui.p2_led_lbl,
                              s_led_on ? "LED 开" : "LED 关");
        }
        if (s_ui.p2_led_state != NULL)
        {
            lv_label_set_text(s_ui.p2_led_state,
                              s_led_on ? "LED 状态  点亮" : "LED 状态  关闭");
        }
    }
    else
    {
        /* Buzzer = PCF8574 P0, low = sound. */
        s_beep_on = s_beep_on ? 0U : 1U;
        BSP_BEEP_Set(s_beep_on);
        if (s_ui.p2_beep_lbl != NULL)
        {
            lv_label_set_text(s_ui.p2_beep_lbl,
                              s_beep_on ? "蜂鸣器 开" : "蜂鸣器 关");
        }
        if (s_ui.p2_beep_state != NULL)
        {
            lv_label_set_text(s_ui.p2_beep_state,
                              s_beep_on ? "蜂鸣器  鸣响" : "蜂鸣器  静音");
        }
    }

    PRINT_LOG("[UI  ] ctrl btn %d -> led=%d beep=%d\r\n",
              code, (int)s_led_on, (int)s_beep_on);
}

