zc110747/MCU-Agent/102.stm32f429_tinyusb_ui/app/app_ui.c
/*----------------------------------------------------------------------------*/
/* Data refresh                                                               */
/*----------------------------------------------------------------------------*/
static const char *usb_state_str(usb_state_t s)
{
    switch (s)
    {
        case USB_DISCONNECTED: return "未连接";
        case USB_CONNECTED:     return "已连接";
        case USB_ENUMERATED:    return "已枚举";
        case USB_MSC_READY:     return "MSC 就绪";
        case USB_MOUNTED:       return "已挂载";
        case USB_ERROR:         return "错误";
        default:                return "未知";
    }
}

static void refresh_usb(void)
{
    if (s_ui.p0_usb != NULL)
    {
        lv_label_set_text_fmt(s_ui.p0_usb, "USB 状态  %s", usb_state_str(g_usb_state));
    }
}

static void refresh_font(void)
{
    uint32_t mask = lcd_driver_font_status();
    const char *src = lcd_driver_font_source();
    const char *status;

    if (s_ui.p0_font == NULL)
    {
        return;
    }

    if (mask == 0U)
    {
        lv_label_set_text(s_ui.p0_font, "字库  未加载");
        return;
    }

    if (src[0] == '1')
    {
        status = "字库  SD 卡 GBK12/16/24/32 已就绪";
    }
    else if (src[0] == '0')
    {
        status = "字库  U 盘 GBK12/16/24/32 已就绪";
    }
    else if ((mask & (FONT_MASK_GBK12 | FONT_MASK_GBK16 |
                      FONT_MASK_GBK24 | FONT_MASK_GBK32)) ==
             (FONT_MASK_GBK12 | FONT_MASK_GBK16 |
              FONT_MASK_GBK24 | FONT_MASK_GBK32))
    {
        status = "字库  GBK12/16/24/32 已就绪";
    }
    else
    {
        status = "字库  部分就绪";
    }
    lv_label_set_text(s_ui.p0_font, status);
}

static void refresh_sd(void)
{
    if (s_ui.p0_sd == NULL)
    {
        return;
    }

    if (sd_card_is_ready() != 0)
    {
        lv_label_set_text_fmt(s_ui.p0_sd, "SD 卡  %lu MB (SDIO 4bit)",
                              (unsigned long)sd_card_capacity_mb());
    }
    else
    {
        lv_label_set_text(s_ui.p0_sd, "SD 卡  未检测到");
    }
}

static void refresh_runtime(void)
{
    uint32_t hits = 0U;
    uint32_t miss = 0U;

    if (s_ui.p0_uptime != NULL)
    {
        lv_label_set_text_fmt(s_ui.p0_uptime, "运行  %02d:%02d:%02d",
                              (int)(s_uptime_sec / 3600U),
                              (int)((s_uptime_sec / 60U) % 60U),
                              (int)(s_uptime_sec % 60U));
    }

    if (s_ui.p0_cache != NULL)
    {
        lv_font_gbk_cache_stats(&hits, &miss);
        lv_label_set_text_fmt(s_ui.p0_cache, "缓存  命中 %d / 读卡 %d",
                              (int)hits, (int)miss);
    }
}

static void refresh_hwinfo(void)
{
    sensor_data_t d;
    char buf[80];

    sensor_get(&d);

    if (s_ui.p1_ir != NULL)
    {
        if (d.ap3216_ok != 0U)
        {
            lv_label_set_text_fmt(s_ui.p1_ir, "红外 IR  %u", (unsigned int)d.ir);
            lv_label_set_text_fmt(s_ui.p1_als, "环境光  %u lux", (unsigned int)d.als);
            lv_label_set_text_fmt(s_ui.p1_ps, "接近  %u", (unsigned int)d.ps);
        }
        else
        {
            lv_label_set_text(s_ui.p1_ir, "红外 IR  --");
            lv_label_set_text(s_ui.p1_als, "环境光  --");
            lv_label_set_text(s_ui.p1_ps, "接近  --");
        }
    }

    if (s_ui.p1_acc != NULL)
    {
        if (d.mpu_ok != 0U)
        {
            fmt_vec3(buf, sizeof(buf), "加速度", d.ax, d.ay, d.az, "g");
            lv_label_set_text(s_ui.p1_acc, buf);

            fmt_vec3(buf, sizeof(buf), "角速度", d.gx, d.gy, d.gz, "dps");
            lv_label_set_text(s_ui.p1_gyr, buf);

            if (d.mag_ok != 0U)
            {
                fmt_vec3(buf, sizeof(buf), "磁场", d.mx, d.my, d.mz, "uT");
                lv_label_set_text(s_ui.p1_mag, buf);
            }
            else
            {
                lv_label_set_text(s_ui.p1_mag, "磁场  AK8963 未装配");
            }
        }
        else
        {
            lv_label_set_text(s_ui.p1_acc, "加速度  --");
            lv_label_set_text(s_ui.p1_gyr, "角速度  --");
            lv_label_set_text(s_ui.p1_mag, "磁场  --");
        }
    }

    if (s_ui.p1_stat != NULL)
    {
        lv_label_set_text_fmt(s_ui.p1_stat, "采样  成功 %lu / 失败 %lu  触摸事件 %lu",
                              (unsigned long)d.samples, (unsigned long)d.errors,
                              (unsigned long)bsp_touch_press_count());
    }
}

static void refresh_ctrl(void)
{
    if (s_ui.p2_led_state != NULL)
    {
        lv_label_set_text(s_ui.p2_led_state,
                          s_led_on ? "LED 状态  点亮" : "LED 状态  关闭");
        if (s_ui.p2_led_lbl != NULL)
        {
            lv_label_set_text(s_ui.p2_led_lbl, s_led_on ? "LED 开" : "LED 关");
        }
    }
    if (s_ui.p2_beep_state != NULL)
    {
        lv_label_set_text(s_ui.p2_beep_state,
                          s_beep_on ? "蜂鸣器  鸣响" : "蜂鸣器  静音");
        if (s_ui.p2_beep_lbl != NULL)
        {
            lv_label_set_text(s_ui.p2_beep_lbl,
                              s_beep_on ? "蜂鸣器 开" : "蜂鸣器 关");
        }
    }
}

static void ui_tick_cb(lv_timer_t *timer)
{
    uint32_t now = HAL_GetTick();

    LV_UNUSED(timer);

    if ((now - s_last_sec_at) >= 1000U)
    {
        s_last_sec_at = now;
        s_uptime_sec++;
    }

    if (s_page == (int)PAGE_STATUS)
    {
        refresh_usb();
        refresh_runtime();

        if (s_refresh_req != 0U)
        {
            refresh_font();
            s_refresh_req = 0U;
        }
    }
    else if (s_page == (int)PAGE_CTRL)
    {
        refresh_ctrl();
    }
    else
    {
        refresh_hwinfo();
    }
}

/*----------------------------------------------------------------------------*/
/* Page switch                                                                */
/*----------------------------------------------------------------------------*/
static void nav_btn_cb(lv_event_t *e)
{
    int delta = (int)(intptr_t)lv_event_get_user_data(e);

    app_ui_switch_page(delta);
}

static void build_nav(void)
{
    lv_obj_t *scr  = lv_scr_act();
    lv_obj_t *bar;
    lv_obj_t *btn_l;
    lv_obj_t *btn_r;
    lv_coord_t bar_w = (lv_coord_t)(s_w - (2 * UI_PAD));
    lv_coord_t bar_h = (lv_coord_t)(NAV_H - 8);
    lv_coord_t btn_y = (lv_coord_t)((bar_h - NAV_BTN_H) / 2);

    bar = lv_obj_create(scr);
    lv_obj_remove_style_all(bar);
    lv_obj_set_size(bar, bar_w, bar_h);
    lv_obj_set_pos(bar, UI_PAD, s_nav_y);
    lv_obj_set_style_bg_color(bar, lv_color_hex(COL_HDR), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(bar, LV_OPA_COVER, LV_PART_MAIN);
    lv_obj_set_style_border_color(bar, lv_color_hex(COL_DIM), LV_PART_MAIN);
    lv_obj_set_style_border_width(bar, 1, LV_PART_MAIN);
    lv_obj_set_style_pad_all(bar, 0, LV_PART_MAIN);
    lv_obj_clear_flag(bar, LV_OBJ_FLAG_SCROLLABLE);

    btn_l = mk_nav_button(bar, 6, btn_y, s_chevron_left);
    lv_obj_add_event_cb(btn_l, nav_btn_cb, LV_EVENT_CLICKED,
                        (void *)(intptr_t)-1);

    btn_r = mk_nav_button(bar, (lv_coord_t)(bar_w - NAV_BTN_W - 6), btn_y,
                          s_chevron_right);
    lv_obj_add_event_cb(btn_r, nav_btn_cb, LV_EVENT_CLICKED,
                        (void *)(intptr_t)1);

