zc110747/MCU-Agent/102.stm32f429_tinyusb_ui/app/app_ui.c
    s_ui.page_lbl = mk_label(bar, 0, (lv_coord_t)((bar_h - 20) / 2),
                             &lv_font_gbk_16, COL_DIM, "");
    lv_obj_set_width(s_ui.page_lbl,
                     (lv_coord_t)(bar_w - (2 * NAV_BTN_W) - 24));
    lv_obj_set_pos(s_ui.page_lbl, (lv_coord_t)(NAV_BTN_W + 12),
                   (lv_coord_t)((bar_h - 20) / 2));
    lv_obj_set_style_text_align(s_ui.page_lbl, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_label_set_text_fmt(s_ui.page_lbl, "%d / %d",
                          (int)(s_page + 1), (int)UI_PAGE_COUNT);
}

/*----------------------------------------------------------------------------*/
/* Frame builders                                                             */
/*----------------------------------------------------------------------------*/
static void build_header(void)
{
    lv_obj_t *scr = lv_scr_act();
    lv_obj_t *hdr;

    hdr = lv_obj_create(scr);
    lv_obj_remove_style_all(hdr);
    lv_obj_set_size(hdr, s_w, HDR_H);
    lv_obj_set_pos(hdr, 0, 0);
    lv_obj_set_style_bg_color(hdr, lv_color_hex(COL_HDR), LV_PART_MAIN);
    lv_obj_set_style_bg_opa(hdr, LV_OPA_COVER, LV_PART_MAIN);
    (void)mk_label_center(hdr, 5, &lv_font_gbk_24, COL_TXT, "STM32F429 信息面板");
}

static void build_page_status(void)
{
    lv_obj_t *scr = lv_scr_act();
    lv_obj_t *b1;
    lv_obj_t *b2;
    lv_obj_t *b3;
    LCD_INFO *info;

    /* Band 1 - 系统初始化 (hardware init summary). */
    b1 = make_band(scr, s_band_y[0], s_band_h, "系统初始化");
    info = get_lcd_info();
    {
        char buf[32];
        snprintf(buf, sizeof(buf), "LCD 控制器  ID = 0x%04X",
                 (unsigned int)((info != NULL) ? info->lcd_id : 0U));
        (void)mk_label(b1, 8, 32, &lv_font_gbk_16, COL_TXT, buf);
        s_ui.p0_sd = mk_label(b1, 8, 56, &lv_font_gbk_16, COL_TXT, "SD 卡  --");
        (void)mk_label(b1, 8, 80, &lv_font_gbk_16, COL_TXT, "USB 主机  已初始化");
        (void)mk_label(b1, 8, 104, &lv_font_gbk_16, COL_DIM, "LVGL 渲染  已就绪");
    }

    /* Band 2 - 运行信息. */
    b2 = make_band(scr, s_band_y[1], s_band_h, "运行信息");
    s_ui.p0_usb   = mk_label(b2, 8, 32,  &lv_font_gbk_16, COL_TXT, "USB 状态  --");
    s_ui.p0_font  = mk_label(b2, 8, 56,  &lv_font_gbk_16, COL_TXT, "字库  --");
    s_ui.p0_freq  = mk_label(b2, 8, 80,  &lv_font_gbk_16, COL_TXT, "");
    lv_label_set_text_fmt(s_ui.p0_freq, "主频  %d MHz",
                          (int)(HAL_RCC_GetSysClockFreq() / 1000000U));
    s_ui.p0_uptime = mk_label(b2, 8, 104, &lv_font_gbk_16, COL_TXT, "运行  00:00:00");
    s_ui.p0_cache  = mk_label(b2, 8, 128, &lv_font_gbk_16, COL_DIM, "缓存  命中 0 / 读卡 0");

    /* Band 3 - 故障/消息. */
    b3 = make_band(scr, s_band_y[2], s_band_h, "故障 / 消息");
    s_ui.p0_f1 = mk_label(b3, 8, 32, &lv_font_gbk_16, COL_TXT, "系统正常");
    s_ui.p0_f2 = mk_label(b3, 8, 56, &lv_font_gbk_16, COL_TXT, "");
    s_ui.p0_f3 = mk_label(b3, 8, 80, &lv_font_gbk_16, COL_TXT, "");
}

static void build_page_hwinfo(void)
{
    lv_obj_t *scr = lv_scr_act();
    lv_obj_t *b1;
    lv_obj_t *b2;
    lv_obj_t *b3;

    /* Band 1 - AP3216C. */
    b1 = make_band(scr, s_band_y[0], s_band_h, "环境传感器  AP3216C");
    s_ui.p1_ir  = mk_label(b1, 8, 32, &lv_font_gbk_16, COL_TXT, "红外 IR  --");
    s_ui.p1_als = mk_label(b1, 8, 56, &lv_font_gbk_16, COL_TXT, "环境光  --");
    s_ui.p1_ps  = mk_label(b1, 8, 80, &lv_font_gbk_16, COL_TXT, "接近  --");

    /* Band 2 - MPU9250 accel + gyro. */
    b2 = make_band(scr, s_band_y[1], s_band_h, "运动传感器  MPU9250");
    s_ui.p1_acc = mk_label(b2, 8, 32, &lv_font_gbk_16, COL_TXT, "加速度  --");
    s_ui.p1_gyr = mk_label(b2, 8, 56, &lv_font_gbk_16, COL_TXT, "角速度  --");
    s_ui.p1_mag = mk_label(b2, 8, 80, &lv_font_gbk_16, COL_TXT, "磁场  --");

    /* Band 3 - sampling health. */
    b3 = make_band(scr, s_band_y[2], s_band_h, "采样状态");
    s_ui.p1_stat = mk_label(b3, 8, 32, &lv_font_gbk_16, COL_DIM, "采样  --");
    (void)mk_label(b3, 8, 56, &lv_font_gbk_16, COL_DIM, "I2C2  PH4(SCL) / PH5(SDA) 400kHz");
}

static void build_page_ctrl(void)
{
    lv_obj_t *scr = lv_scr_act();
    lv_coord_t bw;
    lv_coord_t bh;
    lv_coord_t by;
    lv_coord_t bx0;
    lv_coord_t bx1;
    lv_coord_t st_y;
    lv_coord_t st_h;
    lv_obj_t  *st;

    /* Two side-by-side control buttons under the header. */
    bw  = (lv_coord_t)((s_w - (3 * UI_PAD)) / 2);
    bh  = 200;
    by  = (lv_coord_t)(HDR_H + TOP_GAP + 16);
    bx0 = UI_PAD;
    bx1 = (lv_coord_t)(UI_PAD + bw + UI_PAD);

    s_ui.p2_led_lbl  = mk_ctrl_button(scr, bx0, by, bw, bh, "LED", 1);
    s_ui.p2_led_btn  = lv_obj_get_parent(s_ui.p2_led_lbl);
    s_ui.p2_beep_lbl = mk_ctrl_button(scr, bx1, by, bw, bh, "蜂鸣器", 2);
    s_ui.p2_beep_btn = lv_obj_get_parent(s_ui.p2_beep_lbl);

    /* Status band fills the rest of the content area down to the nav bar. */
    st_y = (lv_coord_t)(by + bh + BAND_GAP);
    st_h = (lv_coord_t)(s_h - st_y - NAV_H - TOP_GAP);
    if (st_h < (3 * BAND_GAP))
    {
        st_h = (lv_coord_t)(3 * BAND_GAP);
    }

    st = make_band(scr, st_y, st_h, "状态");
    s_ui.p2_led_state  = mk_label(st, 8, 32, &lv_font_gbk_16, COL_TXT,
                                  s_led_on ? "LED 状态  点亮" : "LED 状态  关闭");
    s_ui.p2_beep_state = mk_label(st, 8, 56, &lv_font_gbk_16, COL_TXT,
                                  s_beep_on ? "蜂鸣器  鸣响" : "蜂鸣器  静音");
    (void)mk_label(st, 8, 80, &lv_font_gbk_16, COL_DIM,
                   "LED = PB0  蜂鸣器 = PCF8574 P0");
    (void)mk_label(st, 8, 104, &lv_font_gbk_16, COL_DIM,
                   "左右箭头切换界面");
}

static void ui_build(void)
{
    lv_obj_t *scr = lv_scr_act();

    ui_layout();
    ui_set_screen_bg(scr);

    build_header();

    if (s_page == (int)PAGE_HWINFO)
    {
        build_page_hwinfo();
    }
    else if (s_page == (int)PAGE_CTRL)
    {
        build_page_ctrl();
    }
    else
    {
        build_page_status();
    }

    build_nav();

    s_built = 1U;
}

/**
  * @brief  Re-create every widget without touching the refresh timer.
  *         Used by the page switch; the timer keeps running and only refreshes
  *         the labels that belong to the page that is on screen.
  */
static void ui_rebuild(void)
{
    lv_obj_clean(lv_scr_act());
    (void)memset(&s_ui, 0, sizeof(s_ui));
    s_built = 0U;
    ui_build();
}

