zc110747/MCU-Agent/102.stm32f429_tinyusb_ui/app/app_ui.c
/*----------------------------------------------------------------------------*/
/* Public API                                                                 */
/*----------------------------------------------------------------------------*/
void app_ui_create(void)
{
    if (s_built == 0U)
    {
        /* Clear any boot/failure screen that may still be on the display. */
        ui_layout();
        lv_obj_clean(lv_scr_act());
        (void)memset(&s_ui, 0, sizeof(s_ui));
        ui_build();
    }

    s_page       = (int)PAGE_STATUS;
    s_uptime_sec = 0U;
    s_last_sec_at = HAL_GetTick();
    s_refresh_req = 1U;   /* re-read font status on first tick */

    refresh_sd();
    refresh_font();
    refresh_usb();
    refresh_runtime();

    if (s_timer == NULL)
    {
        s_timer = lv_timer_create(ui_tick_cb, UI_REFRESH_MS, NULL);
    }
}

void app_ui_show_centered(const char *text)
{
    lv_obj_t *scr = lv_scr_act();
    lv_obj_t *lbl;

    ui_teardown();
    ui_layout();
    ui_set_screen_bg(scr);

    /* ASCII-only: the glyphs come from the compiled-in ASCII tables, so this
     * screen renders correctly with no font file and no filesystem. */
    lbl = mk_label_center(scr, 0, &lv_font_gbk_24, COL_TXT,
                          (text != NULL) ? text : "");
    lv_obj_align(lbl, LV_ALIGN_CENTER, 0, 0);
}

void app_ui_show_fault(const char *line1, const char *line2, const char *line3)
{
    if (s_built == 0U)
    {
        ui_layout();
        lv_obj_clean(lv_scr_act());
        (void)memset(&s_ui, 0, sizeof(s_ui));
        ui_build();
    }

    if (s_ui.p0_f1 != NULL)
    {
        lv_label_set_text(s_ui.p0_f1,
                          (line1 != NULL && line1[0] != '\0') ? line1 : "");
    }
    if (s_ui.p0_f2 != NULL)
    {
        lv_label_set_text(s_ui.p0_f2,
                          (line2 != NULL && line2[0] != '\0') ? line2 : "");
    }
    if (s_ui.p0_f3 != NULL)
    {
        lv_label_set_text(s_ui.p0_f3,
                          (line3 != NULL && line3[0] != '\0') ? line3 : "");
    }
}

void app_ui_request_usb_refresh(void)
{
    if (s_built != 0U)
    {
        s_refresh_req = 1U;
    }
}

void app_ui_switch_page(int delta)
{
    int next = s_page + delta;

    /* Cyclic: wrap into [0, UI_PAGE_COUNT) in both directions. */
    next %= (int)UI_PAGE_COUNT;
    if (next < 0)
    {
        next += (int)UI_PAGE_COUNT;
    }

    if (next == s_page)
    {
        return;
    }

    s_page = next;
    ui_rebuild();

    /* Republish the values that the new page shows. */
    if (s_page == (int)PAGE_STATUS)
    {
        refresh_usb();
        refresh_sd();
        refresh_font();
        refresh_runtime();
    }
    else if (s_page == (int)PAGE_CTRL)
    {
        refresh_ctrl();
    }
    else
    {
        refresh_hwinfo();
    }

    PRINT_LOG("[UI  ] page -> %d / %d\r\n",
           (int)(s_page + 1), (int)UI_PAGE_COUNT);
}

int app_ui_page(void)
{
    return s_page;
}
